# Задайте два числа. Нипишите программу,к
# которая найдет НОК (наименьшее общее кратное) этих чисел.
import sympy
a = int(input('A = '))
b = int(input('B = '))
xa = 0
xb = 0
# print(sympy.lcm(a, b))
while xa == xb:
    